# 10days

# 1000個の瓶に0~999番の番号をつけるとする
#
# 1st day: 0~99 | 100~199 | 200~299 | ... | 900~999 の10グループにわけて試験する (100の位が0~9のグループ分け)
# 2nd day: 0~9, 100~109, ... | 10~19, 110~119, ... | 20~29, 120 ~ 129, ... | ... ... ... | 90~99, 190~199, ... | の10グループにわけて試験する (10の位が0~9のグループ分け)
# 3rd day: 1, 11, 21, ... , 991 | 2, 12, 22, ... , 992 | ... ... ... | 9, 19, 29, ... , 999 | の10グループにわけて試験する（1の位が0~9のグループ分け）
#
# 4~7th day: You can sleep deeply, zzz...
#
# 8th day: 100の位が0~9のどれか分かる
# 9th day: 10の位が0~9のどれか分かる
# 10th day: 1の位が0~9のどれか分かる
